Merge branch 'dev' of https://github.com/ejay-detera/capstone-auth-module into dev
